{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os, sys"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4j.data import Record\n",
    "from dotenv import dotenv_values\n",
    "from models import *\n",
    "\n",
    "config = dotenv_values(\".env\")  # config = {\"USER\": \"foo\", \"EMAIL\": \"foo@example.org\"}\n",
    "\n",
    "class GraphDBDriver:\n",
    "    \"\"\"\n",
    "    Main methods:\n",
    "        query_node_dict: Query database by a node dictionary\n",
    "        query: makes a direct cypher query\n",
    "        upload_nodes: Upload an iterable of nodes to the database\n",
    "        upload_edges: Upload an iterable of edges to the database\n",
    "\n",
    "    \"\"\"\n",
    "    def __init__(self, remote=False):\n",
    "        if remote:\n",
    "            uri = config[\"REMOTE_GRAPH_URI\"]\n",
    "            user = config[\"REMOTE_GRAPH_USER\"]\n",
    "            password = config[\"REMOTE_GRAPH_PWD\"]\n",
    "        else:\n",
    "            uri = config[\"LOCAL_GRAPH_URI\"]\n",
    "            user = config[\"LOCAL_GRAPH_USER\"]\n",
    "            password = config[\"LOCAL_GRAPH_PWD\"]\n",
    "\n",
    "        try:\n",
    "            self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "        except Exception as e:\n",
    "            self.driver = None\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "\n",
    "    def close(self):\n",
    "        if self.driver:\n",
    "            self.driver.close()\n",
    "\n",
    "    # Query Methods (returns a list of neo4j.data.Records)\n",
    "    def query_node_dict(self, node_dict):\n",
    "        return self.query(\"MATCH \" + self._node_dict_to_cypher(node_dict) + \" RETURN node\")\n",
    "    \n",
    "    def query_node(self, node):\n",
    "#         print(\"MATCH (node:{} {{key: \\\"{}\\\"}}) RETURN node\".format(node.type, node.key))\n",
    "        return self.query(\"MATCH (node:{} {{key: \\\"{}\\\"}}) RETURN node\".format(node.type, node.key))\n",
    "\n",
    "    def query_edge(self, edge):\n",
    "        return self.query(\"MATCH (a:{} {{key: \\\"{}\\\"}})-[edge:{}]->(b:{} {{key: \\\"{}\\\"}}) RETURN edge\".format(edge.source.type, edge.source.key, edge.label, edge.dest.type, edge.dest.key))\n",
    "\n",
    "    # Returns a list of neo4j.data.Records\n",
    "    def raw_query(self, query, parse_node=False):\n",
    "        assert self.driver, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.driver.session()\n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session:\n",
    "                session.close()\n",
    "        if parse_node:\n",
    "            return [self.record_to_models(record)['node'] for record in response]\n",
    "        else:\n",
    "            return response    \n",
    "\n",
    "    # Upload Methods\n",
    "    # Node Methods\n",
    "    def upload_nodes(self, nodes):\n",
    "        assert self.driver, \"Driver not initialized!\"\n",
    "        with self.driver.session() as session:\n",
    "            ret = []\n",
    "            for node in nodes:\n",
    "                exists = list(session.run(\"MATCH (node:{} {{key: \\\"{}\\\"}}) RETURN node\".format(node.type, node.key)))\n",
    "                if len(exists) == 0:\n",
    "                    # print(\"Attempting to upload\", node.title, str(node.attrs))\n",
    "                    # assert type(doc) == Document , \"Error: non-Document node passed to doc upload function\"\n",
    "                    ret.append(session.write_transaction(self._create_and_return_node, node.to_dict()))\n",
    "                    print(\"Uploaded\", ret[-1])\n",
    "                else:\n",
    "                    print(node.key, \"already exists in database\")\n",
    "            return ret\n",
    "\n",
    "    @staticmethod\n",
    "    def _create_and_return_node(tx, node_dict):\n",
    "        cypherquery = [\"CREATE (node:{})\".format(node_dict['type'])]\n",
    "        for key in node_dict.keys():\n",
    "            cypherquery.append(\"SET node.{} = ${}\".format(key, key))\n",
    "        cypherquery.append(\"RETURN node\")\n",
    "#         print(\" \".join(cypherquery))\n",
    "        result = tx.run(\" \".join(cypherquery), node_dict)\n",
    "        entry = result.single()        \n",
    "        return entry['node'] if entry else None\n",
    "\n",
    "    # Edges Methods\n",
    "    def upload_edges(self, edges):\n",
    "        assert self.driver, \"Driver not initialized!\"\n",
    "        with self.driver.session() as session:\n",
    "            ret = []\n",
    "            for edge in edges:\n",
    "                exists = list(session.run(\"MATCH (a:{} {{key: \\\"{}\\\"}})-[edge:{}]->(b:{} {{key: \\\"{}\\\"}}) RETURN edge\".format(edge.source_type, edge.source_key, edge.label, edge.dest_type, edge.dest_key)))\n",
    "                if len(exists) == 0:\n",
    "                    # assert type(doc) == Document , \"Error: non-Document node passed to doc upload function\"\n",
    "                    ret.append(session.write_transaction(self._create_and_return_edge, edge.to_dict(), edge.source_key, edge.dest_key))\n",
    "                    print(\"Uploaded\", ret[-1])\n",
    "                else:\n",
    "                    print(str(edge), \"already exists in database\")\n",
    "            return ret\n",
    "\n",
    "    @staticmethod\n",
    "    def _create_and_return_edge(tx, edge_dict, source_key, dest_key):\n",
    "        cypherquery = [\"MATCH (a), (b)\", \"WHERE a.key=\\\"{}\\\" AND b.key = \\\"{}\\\"\".format(source_key, dest_key), \"CREATE (a)-[edge:{}]->(b)\".format(edge_dict['label'])]\n",
    "        for key in edge_dict.keys():\n",
    "            cypherquery.append(\"SET edge.{} = ${}\".format(key, key))\n",
    "        cypherquery.append(\"RETURN edge\")\n",
    "#         print(\" \".join(cypherquery))\n",
    "        result = tx.run(\" \".join(cypherquery), edge_dict)\n",
    "        # print(result)\n",
    "        entry = result.single()        \n",
    "        return entry['edge'] if entry else None\n",
    "\n",
    "    # Helper Methods\n",
    "    \"\"\"\n",
    "    Converts a node in dictionary form to a cypher create query\n",
    "    \"\"\"\n",
    "    @staticmethod\n",
    "    def _node_dict_to_cypher(node, name=\"node\"):\n",
    "        assert type(node) in [dict, defaultdict]\n",
    "        query = \"({}:{} {{\".format(name, node['type'])\n",
    "        properties = []\n",
    "        for key, value in node.items():\n",
    "            properties.append(\"{}:\\\"{}\\\"\".format(key, value))\n",
    "        props = \", \".join(properties)\n",
    "        end_query = \"})\"\n",
    "        return query + props + end_query\n",
    "\n",
    "    \"\"\"\n",
    "    Converts a returned object to a dictionary of Node or Edge from Soup Models\n",
    "    \"\"\"\n",
    "    @staticmethod\n",
    "    def record_to_models(record):\n",
    "        assert type(record) == Record\n",
    "        assert 'node' in record.keys() or 'edge' in record.keys(), \"Neither node or edge found in record keys: \" + str(record.keys())\n",
    "        ret = dict()\n",
    "        def node_to_model(node):\n",
    "            # print(node)\n",
    "            # print(node.keys())\n",
    "            if node['type'] == 'entity':\n",
    "                return Entity(node['key'], attrs=dict(node))\n",
    "            elif node['type'] == 'action':\n",
    "                return Action(node['key'], attrs=dict(node))\n",
    "            elif node['type'] == 'source':\n",
    "                return Source(node['key'], node['name'], node['source_type'], attrs=dict(node), date_processed=node['date_processed'])\n",
    "            elif node['type'] == 'document':\n",
    "                return Document(node['key'], node['title'], node['doc_type'], attrs=dict(node), date_processed=node['date_processed'])\n",
    "            else:\n",
    "                print(\"ERROR: unrecognized node type:\", node['type'])\n",
    "\n",
    "        # Process Node\n",
    "        if 'node' in record.keys():\n",
    "            assert record['node']['type'] in ['entity', 'action', 'source', 'document'], \"Error: unidentified node type \" + record['node']['type']\n",
    "            node = node_to_model(record['node'])\n",
    "            if node:\n",
    "                ret['node'] = node\n",
    "        \n",
    "        # TODO: This part can probably be greatly optimized since I am building two new node objects for every edge\n",
    "        # Process Edge\n",
    "        if 'edge' in record.keys():\n",
    "            assert record['edge']['label'] in ['contains', 'authored', 'interacts', 'references', 'involved'], \"Error: unidentified edge type \" + record['edge']['label']\n",
    "            edge = record['edge']\n",
    "            # source, dest = node_to_model(edge.nodes[0]), node_to_model(edge.nodes[1])\n",
    "            # if edge['label'] == 'contains':\n",
    "            #     ret['edge'] = Contains(source, dest)\n",
    "            # elif edge['label'] == 'authored':\n",
    "            #     ret['edge'] = Authored(source, dest)\n",
    "            # elif edge['label'] == 'interacts':\n",
    "            #     ret['edge'] = Interacts(source, dest, edge['interaction_type'])\n",
    "            # elif edge['label'] == 'references':\n",
    "            #     ret['edge'] = References(source, dest)\n",
    "            # elif edge['label'] == 'involved':\n",
    "            #     ret['edge'] = Involved(source, dest)\n",
    "            ret['edge'] = (edge['label'], edge['source_key'], edge['dest_key'])\n",
    "        \n",
    "        return ret\n",
    "            \n",
    "\n",
    "# if __name__ == \"__main__\":  \n",
    "#     # greeter = HelloWorldExample(\"bolt://localhost:7687\", \"neo4j\", \"neo4j\")\n",
    "#     print(\"Testing Graph Driver...\")\n",
    "#     driver = GraphDBDriver()\n",
    "#     ret = driver.query(\"MATCH (node)-[edge:interacts]->() RETURN node, edge\")\n",
    "#     res = driver.record_to_models(ret[0])\n",
    "#     print(res)\n",
    "#     # print(\"Querying all nodes\")\n",
    "#     # print(driver.query(\"MATCH (n) return n\"))\n",
    "#     # print(\"Uploading one node\")\n",
    "#     # tweet1 = Document(\"tweet1\", \"title\", \"tweet\")\n",
    "#     # source = Source(\"source1\", \"title\", \"source\")\n",
    "#     # driver.upload_nodes([tweet1, source])\n",
    "#     # print(\"Adding connecting Edge\")\n",
    "#     # edge = Interacts(source, tweet1, \"follows\")\n",
    "#     # driver.upload_edges([edge])\n",
    "#     # # driver.close()\n",
    "    \n",
    "#     # print(\"Querying single node\")\n",
    "#     # result = driver.query_node(tweet1)\n",
    "#     # print(result[0]['node'].keys())\n",
    "#     # result1 = driver.query_edge(edge)\n",
    "#     # print(result1[0]['edge'].keys())\n",
    "#     # # print(\"Uploading several nodes with pre-existing in database\")\n",
    "#     # # tweets = [tweet, Document(\"test2\", \"title\", \"tweet\"), Document(\"test3\", \"title\", \"tweet\")]\n",
    "#     # # # driver.upload_nodes(tweets)\n",
    "#     # driver.close()\n",
    "#     # print(\"Finished\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(10,\n",
       " models.Source,\n",
       " [<models.Source at 0x1bb61a02c88>,\n",
       "  <models.Source at 0x1bb61a02cc0>,\n",
       "  <models.Source at 0x1bb61a1aac8>,\n",
       "  <models.Source at 0x1bb61a1a748>,\n",
       "  <models.Source at 0x1bb61a1a048>,\n",
       "  <models.Source at 0x1bb6014db00>,\n",
       "  <models.Source at 0x1bb624e2240>,\n",
       "  <models.Source at 0x1bb62432780>,\n",
       "  <models.Source at 0x1bb62432a90>,\n",
       "  <models.Source at 0x1bb624325c0>])"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver = GraphDBDriver()\n",
    "ret = driver.raw_query(\"MATCH (node:source) RETURN node LIMIT 10\", parse_node=True)\n",
    "len(ret), type(ret[0]), ret"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'node': <models.Document at 0x1bb6014d8d0>}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.record_to_models(ret[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for node_type in [\"document\", \"entity\", \"action\", \"source\"]:\n",
    "    querystring = \"CREATE CONSTRAINT unique_key_{} IF NOT EXISTS ON (n:{}) ASSERT n.key IS UNIQUE\".format(node_type, node_type)\n",
    "    print(driver.query(querystring))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.query_node(tweet)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.upload_nodes(tweets)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "mpython36",
   "language": "python",
   "name": "mpython36"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
